96cClient/r10196_wr_20231204_19:42:03_sbtest1M_tableSize_1000_tableCount_128_time_300_x1_threadCount_512_core_128_sbtest1M_run.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 512
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 512 tps: 1937.56 qps: 38624.39 (r/w/o: 24494.49/9742.69/4387.21) lat (ms,95%): 831.46 err/s: 1.00 reconn/s: 0.00
[ 2s ] thds: 512 tps: 8579.95 qps: 136356.01 (r/w/o: 85436.43/33762.68/17156.90) lat (ms,95%): 101.13 err/s: 2.00 reconn/s: 0.00
[ 3s ] thds: 512 tps: 8563.84 qps: 136552.49 (r/w/o: 85515.43/33911.38/17125.68) lat (ms,95%): 101.13 err/s: 1.00 reconn/s: 0.00
[ 4s ] thds: 512 tps: 8334.59 qps: 134859.50 (r/w/o: 83883.58/34296.75/16679.18) lat (ms,95%): 104.84 err/s: 2.00 reconn/s: 0.00
[ 5s ] thds: 512 tps: 8701.94 qps: 137861.09 (r/w/o: 86446.00/34011.21/17403.88) lat (ms,95%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 512 tps: 8847.28 qps: 142462.50 (r/w/o: 88844.81/35923.13/17694.56) lat (ms,95%): 97.55 err/s: 1.00 reconn/s: 0.00
[ 7s ] thds: 512 tps: 8828.67 qps: 141004.78 (r/w/o: 88286.73/35059.70/17658.35) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 512 tps: 8606.37 qps: 137511.98 (r/w/o: 85978.74/34319.49/17213.75) lat (ms,95%): 99.33 err/s: 1.00 reconn/s: 0.00
[ 9s ] thds: 512 tps: 8680.58 qps: 137363.88 (r/w/o: 85935.14/34115.56/17313.18) lat (ms,95%): 102.97 err/s: 1.00 reconn/s: 0.00
[ 10s ] thds: 512 tps: 8425.46 qps: 136322.28 (r/w/o: 84880.57/34552.79/16888.92) lat (ms,95%): 99.33 err/s: 1.00 reconn/s: 0.00
[ 11s ] thds: 512 tps: 8566.63 qps: 136576.93 (r/w/o: 85524.27/33911.38/17141.27) lat (ms,95%): 99.33 err/s: 2.00 reconn/s: 0.00
[ 12s ] thds: 512 tps: 8756.03 qps: 140336.49 (r/w/o: 88067.31/34753.12/17516.06) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 512 tps: 8352.06 qps: 134887.36 (r/w/o: 83756.48/34423.76/16707.12) lat (ms,95%): 95.81 err/s: 1.00 reconn/s: 0.00
[ 14s ] thds: 512 tps: 8996.93 qps: 141755.93 (r/w/o: 88688.74/35074.32/17992.86) lat (ms,95%): 95.81 err/s: 1.00 reconn/s: 0.00
[ 15s ] thds: 512 tps: 7878.20 qps: 127198.15 (r/w/o: 79624.97/31816.79/15756.39) lat (ms,95%): 139.85 err/s: 3.00 reconn/s: 0.00
[ 16s ] thds: 512 tps: 8503.77 qps: 136031.34 (r/w/o: 84854.72/34163.08/17013.54) lat (ms,95%): 102.97 err/s: 1.00 reconn/s: 0.00
[ 17s ] thds: 512 tps: 8567.30 qps: 136082.70 (r/w/o: 85206.94/33742.17/17133.59) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 512 tps: 8435.04 qps: 136781.68 (r/w/o: 85358.42/34552.17/16871.08) lat (ms,95%): 97.55 err/s: 1.00 reconn/s: 0.00
[ 19s ] thds: 512 tps: 8691.86 qps: 137429.73 (r/w/o: 85945.58/34100.44/17383.71) lat (ms,95%): 110.66 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 512 tps: 8775.24 qps: 141548.81 (r/w/o: 88696.39/35295.95/17556.47) lat (ms,95%): 97.55 err/s: 6.00 reconn/s: 0.00
[ 21s ] thds: 512 tps: 8718.80 qps: 139763.74 (r/w/o: 87371.96/34951.19/17440.59) lat (ms,95%): 94.10 err/s: 2.00 reconn/s: 0.00
[ 22s ] thds: 512 tps: 8658.33 qps: 138846.23 (r/w/o: 86524.26/35002.32/17319.65) lat (ms,95%): 110.66 err/s: 3.00 reconn/s: 0.00
[ 23s ] thds: 512 tps: 8401.59 qps: 133283.55 (r/w/o: 83304.97/33176.39/16802.19) lat (ms,95%): 110.66 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 512 tps: 8351.04 qps: 133458.58 (r/w/o: 83601.36/33155.14/16702.07) lat (ms,95%): 102.97 err/s: 1.00 reconn/s: 0.00
[ 25s ] thds: 512 tps: 8674.07 qps: 139554.06 (r/w/o: 87185.66/35018.26/17350.13) lat (ms,95%): 94.10 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 512 tps: 8552.97 qps: 135069.53 (r/w/o: 84575.71/33413.88/17079.94) lat (ms,95%): 104.84 err/s: 2.00 reconn/s: 0.00
[ 27s ] thds: 512 tps: 8973.27 qps: 144193.34 (r/w/o: 90176.71/36041.09/17975.54) lat (ms,95%): 95.81 err/s: 1.00 reconn/s: 0.00
[ 28s ] thds: 512 tps: 8956.73 qps: 141786.78 (r/w/o: 88368.37/35510.94/17907.47) lat (ms,95%): 92.42 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 512 tps: 8879.12 qps: 144494.66 (r/w/o: 90475.02/36255.40/17764.24) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 512 tps: 8992.87 qps: 144023.89 (r/w/o: 90106.67/35927.48/17989.74) lat (ms,95%): 92.42 err/s: 4.00 reconn/s: 0.00
[ 31s ] thds: 512 tps: 8990.96 qps: 144271.20 (r/w/o: 89934.55/36356.73/17979.91) lat (ms,95%): 99.33 err/s: 1.00 reconn/s: 0.00
[ 32s ] thds: 512 tps: 8853.06 qps: 141608.00 (r/w/o: 88411.60/35485.27/17711.13) lat (ms,95%): 102.97 err/s: 3.00 reconn/s: 0.00
[ 33s ] thds: 512 tps: 8922.56 qps: 142186.91 (r/w/o: 89202.55/35138.25/17846.11) lat (ms,95%): 99.33 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 512 tps: 8591.98 qps: 137183.65 (r/w/o: 85600.77/34397.93/17184.96) lat (ms,95%): 110.66 err/s: 1.00 reconn/s: 0.00
[ 35s ] thds: 512 tps: 9038.79 qps: 143612.03 (r/w/o: 89690.17/35934.25/17987.62) lat (ms,95%): 94.10 err/s: 1.00 reconn/s: 0.00
[ 36s ] thds: 512 tps: 8823.59 qps: 141428.63 (r/w/o: 88527.09/35162.31/17739.24) lat (ms,95%): 95.81 err/s: 1.00 reconn/s: 0.00
[ 37s ] thds: 512 tps: 9114.48 qps: 144755.74 (r/w/o: 89916.87/36704.91/18133.97) lat (ms,95%): 94.10 err/s: 1.00 reconn/s: 0.00
[ 38s ] thds: 512 tps: 9081.43 qps: 145158.92 (r/w/o: 91326.35/35574.70/18257.87) lat (ms,95%): 90.78 err/s: 2.00 reconn/s: 0.00
[ 39s ] thds: 512 tps: 8705.38 qps: 142731.26 (r/w/o: 88959.90/36356.60/17414.76) lat (ms,95%): 97.55 err/s: 1.00 reconn/s: 0.00
[ 40s ] thds: 512 tps: 8756.84 qps: 140345.36 (r/w/o: 87615.35/35213.34/17516.67) lat (ms,95%): 95.81 err/s: 4.00 reconn/s: 0.00
[ 41s ] thds: 512 tps: 8895.41 qps: 142415.51 (r/w/o: 88964.10/35659.59/17791.82) lat (ms,95%): 95.81 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 512 tps: 8841.58 qps: 140789.77 (r/w/o: 88251.67/34855.94/17682.16) lat (ms,95%): 104.84 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 512 tps: 9171.85 qps: 145246.65 (r/w/o: 90841.53/36059.42/18345.70) lat (ms,95%): 95.81 err/s: 1.00 reconn/s: 0.00
[ 44s ] thds: 512 tps: 8921.80 qps: 143059.80 (r/w/o: 89327.00/35891.20/17841.60) lat (ms,95%): 97.55 err/s: 1.00 reconn/s: 0.00
[ 45s ] thds: 512 tps: 8923.91 qps: 143604.51 (r/w/o: 89528.07/36235.62/17840.81) lat (ms,95%): 102.97 err/s: 1.00 reconn/s: 0.00
[ 46s ] thds: 512 tps: 9043.31 qps: 144742.01 (r/w/o: 90545.13/36103.25/18093.63) lat (ms,95%): 95.81 err/s: 1.00 reconn/s: 0.00
[ 47s ] thds: 512 tps: 8816.26 qps: 139569.18 (r/w/o: 87570.62/34410.03/17588.53) lat (ms,95%): 97.55 err/s: 2.00 reconn/s: 0.00
[ 48s ] thds: 512 tps: 8691.35 qps: 140613.45 (r/w/o: 87679.42/35498.34/17435.69) lat (ms,95%): 99.33 err/s: 2.00 reconn/s: 0.00
[ 49s ] thds: 512 tps: 8658.72 qps: 139427.55 (r/w/o: 86965.20/35141.91/17320.43) lat (ms,95%): 99.33 err/s: 4.00 reconn/s: 0.00
[ 50s ] thds: 512 tps: 8909.49 qps: 142328.83 (r/w/o: 88969.89/35532.96/17825.98) lat (ms,95%): 101.13 err/s: 7.00 reconn/s: 0.00
[ 51s ] thds: 512 tps: 8440.38 qps: 135120.06 (r/w/o: 84544.79/33697.51/16877.76) lat (ms,95%): 102.97 err/s: 2.00 reconn/s: 0.00
[ 52s ] thds: 512 tps: 8983.68 qps: 142062.27 (r/w/o: 89165.95/34919.97/17976.35) lat (ms,95%): 89.16 err/s: 3.00 reconn/s: 0.00
[ 53s ] thds: 512 tps: 9203.35 qps: 145678.65 (r/w/o: 90872.54/36398.41/18407.69) lat (ms,95%): 97.55 err/s: 2.00 reconn/s: 0.00
[ 54s ] thds: 512 tps: 8643.63 qps: 140634.28 (r/w/o: 87797.42/35549.60/17287.26) lat (ms,95%): 95.81 err/s: 1.00 reconn/s: 0.00
[ 55s ] thds: 512 tps: 9154.55 qps: 146725.79 (r/w/o: 91425.51/37008.18/18292.10) lat (ms,95%): 92.42 err/s: 3.00 reconn/s: 0.00
[ 56s ] thds: 512 tps: 8850.60 qps: 142662.76 (r/w/o: 89313.13/35626.43/17723.20) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 512 tps: 9230.95 qps: 145498.76 (r/w/o: 91128.81/35911.04/18458.91) lat (ms,95%): 99.33 err/s: 2.00 reconn/s: 0.00
[ 58s ] thds: 512 tps: 9370.52 qps: 151167.41 (r/w/o: 94560.26/37861.11/18746.04) lat (ms,95%): 95.81 err/s: 2.00 reconn/s: 0.00
[ 59s ] thds: 512 tps: 9236.20 qps: 146757.23 (r/w/o: 91607.03/36693.81/18456.39) lat (ms,95%): 94.10 err/s: 1.00 reconn/s: 0.00
[ 60s ] thds: 512 tps: 9412.15 qps: 150189.38 (r/w/o: 94078.49/37275.59/18835.30) lat (ms,95%): 89.16 err/s: 3.00 reconn/s: 0.00
[ 61s ] thds: 512 tps: 8915.98 qps: 144701.60 (r/w/o: 90330.75/36526.90/17843.95) lat (ms,95%): 94.10 err/s: 1.00 reconn/s: 0.00
[ 62s ] thds: 512 tps: 9142.57 qps: 146885.33 (r/w/o: 91515.72/37084.47/18285.14) lat (ms,95%): 89.16 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 512 tps: 8919.97 qps: 142769.44 (r/w/o: 89219.65/35707.86/17841.93) lat (ms,95%): 89.16 err/s: 2.00 reconn/s: 0.00
[ 64s ] thds: 512 tps: 9477.29 qps: 149932.54 (r/w/o: 93839.40/37141.56/18951.59) lat (ms,95%): 87.56 err/s: 2.00 reconn/s: 0.00
[ 65s ] thds: 512 tps: 8833.53 qps: 140701.37 (r/w/o: 88298.33/34736.97/17666.07) lat (ms,95%): 94.10 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 512 tps: 9244.47 qps: 148960.17 (r/w/o: 92863.54/37601.69/18494.93) lat (ms,95%): 92.42 err/s: 2.00 reconn/s: 0.00
[ 67s ] thds: 512 tps: 8991.51 qps: 145187.97 (r/w/o: 90514.02/36686.93/17987.02) lat (ms,95%): 92.42 err/s: 2.00 reconn/s: 0.00
[ 68s ] thds: 512 tps: 9062.96 qps: 145012.36 (r/w/o: 90631.60/36254.84/18125.92) lat (ms,95%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 512 tps: 9355.15 qps: 148750.49 (r/w/o: 93281.53/36757.66/18711.30) lat (ms,95%): 95.81 err/s: 1.00 reconn/s: 0.00
[ 70s ] thds: 512 tps: 9412.39 qps: 150140.29 (r/w/o: 94000.94/37314.56/18824.79) lat (ms,95%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 512 tps: 9028.79 qps: 142743.28 (r/w/o: 88726.47/35978.22/18038.59) lat (ms,95%): 97.55 err/s: 2.00 reconn/s: 0.00
[ 72s ] thds: 512 tps: 9178.84 qps: 148975.90 (r/w/o: 93457.75/37134.45/18383.69) lat (ms,95%): 94.10 err/s: 5.00 reconn/s: 0.00
[ 73s ] thds: 512 tps: 8812.66 qps: 141619.51 (r/w/o: 88318.58/35675.62/17625.32) lat (ms,95%): 101.13 err/s: 2.00 reconn/s: 0.00
[ 74s ] thds: 512 tps: 9294.56 qps: 148312.09 (r/w/o: 92497.71/37239.25/18575.13) lat (ms,95%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 512 tps: 9318.72 qps: 147268.76 (r/w/o: 92154.77/36508.57/18605.42) lat (ms,95%): 92.42 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 512 tps: 9004.67 qps: 146360.91 (r/w/o: 91644.83/36655.73/18060.35) lat (ms,95%): 89.16 err/s: 3.00 reconn/s: 0.00
[ 77s ] thds: 512 tps: 9094.77 qps: 144569.42 (r/w/o: 90432.76/35946.11/18190.55) lat (ms,95%): 97.55 err/s: 1.00 reconn/s: 0.00
[ 78s ] thds: 512 tps: 9614.75 qps: 153118.97 (r/w/o: 95630.48/38259.99/19228.49) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 512 tps: 9239.37 qps: 148421.88 (r/w/o: 92730.67/37211.47/18479.73) lat (ms,95%): 95.81 err/s: 3.00 reconn/s: 0.00
[ 80s ] thds: 512 tps: 9170.84 qps: 147253.49 (r/w/o: 92283.43/36623.38/18346.69) lat (ms,95%): 94.10 err/s: 2.00 reconn/s: 0.00
[ 81s ] thds: 512 tps: 9056.94 qps: 145321.05 (r/w/o: 90729.42/36476.75/18114.89) lat (ms,95%): 94.10 err/s: 3.00 reconn/s: 0.00
[ 82s ] thds: 512 tps: 9166.89 qps: 145811.30 (r/w/o: 91092.94/36388.58/18329.77) lat (ms,95%): 92.42 err/s: 0.00 reconn/s: 0.00
[ 83s ] thds: 512 tps: 8784.33 qps: 141405.39 (r/w/o: 88178.36/35654.36/17572.67) lat (ms,95%): 94.10 err/s: 1.00 reconn/s: 0.00
[ 84s ] thds: 512 tps: 8851.05 qps: 142018.76 (r/w/o: 88889.47/35423.19/17706.09) lat (ms,95%): 89.16 err/s: 1.00 reconn/s: 0.00
[ 85s ] thds: 512 tps: 8887.80 qps: 142393.74 (r/w/o: 88897.95/35719.20/17776.59) lat (ms,95%): 97.55 err/s: 1.00 reconn/s: 0.00
[ 86s ] thds: 512 tps: 9505.94 qps: 150805.18 (r/w/o: 94598.45/37194.85/19011.88) lat (ms,95%): 89.16 err/s: 0.00 reconn/s: 0.00
[ 87s ] thds: 512 tps: 9417.10 qps: 150288.62 (r/w/o: 93877.02/37580.40/18831.20) lat (ms,95%): 92.42 err/s: 0.00 reconn/s: 0.00
[ 88s ] thds: 512 tps: 9021.17 qps: 144403.71 (r/w/o: 90196.70/36166.67/18040.34) lat (ms,95%): 92.42 err/s: 2.00 reconn/s: 0.00
[ 89s ] thds: 512 tps: 9243.39 qps: 149594.82 (r/w/o: 93260.17/37839.87/18494.78) lat (ms,95%): 90.78 err/s: 1.00 reconn/s: 0.00
[ 90s ] thds: 512 tps: 9399.07 qps: 148579.49 (r/w/o: 93052.89/36726.46/18800.14) lat (ms,95%): 89.16 err/s: 2.00 reconn/s: 0.00
[ 91s ] thds: 512 tps: 9173.62 qps: 146723.86 (r/w/o: 91948.15/36423.47/18352.23) lat (ms,95%): 90.78 err/s: 5.00 reconn/s: 0.00
[ 92s ] thds: 512 tps: 9122.01 qps: 147532.75 (r/w/o: 91812.93/37481.81/18238.01) lat (ms,95%): 92.42 err/s: 3.00 reconn/s: 0.00
[ 93s ] thds: 512 tps: 9189.22 qps: 146791.49 (r/w/o: 91664.18/36752.87/18374.44) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 94s ] thds: 512 tps: 9608.78 qps: 151773.17 (r/w/o: 94799.59/37753.01/19220.57) lat (ms,95%): 90.78 err/s: 1.00 reconn/s: 0.00
[ 95s ] thds: 512 tps: 9457.43 qps: 152848.92 (r/w/o: 95733.33/38189.73/18925.86) lat (ms,95%): 89.16 err/s: 1.00 reconn/s: 0.00
[ 96s ] thds: 512 tps: 9716.45 qps: 154368.32 (r/w/o: 96434.58/38523.83/19409.91) lat (ms,95%): 84.47 err/s: 2.00 reconn/s: 0.00
[ 97s ] thds: 512 tps: 9439.52 qps: 150030.48 (r/w/o: 93661.32/37464.13/18905.04) lat (ms,95%): 86.00 err/s: 2.00 reconn/s: 0.00
[ 98s ] thds: 512 tps: 9241.91 qps: 151223.95 (r/w/o: 94546.98/38189.15/18487.82) lat (ms,95%): 92.42 err/s: 2.00 reconn/s: 0.00
[ 99s ] thds: 512 tps: 9273.10 qps: 147371.19 (r/w/o: 92003.44/36834.55/18533.20) lat (ms,95%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 512 tps: 9807.59 qps: 156517.23 (r/w/o: 98161.89/38728.16/19627.18) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 101s ] thds: 512 tps: 9515.38 qps: 151470.02 (r/w/o: 94545.76/37892.51/19031.76) lat (ms,95%): 86.00 err/s: 2.00 reconn/s: 0.00
[ 102s ] thds: 512 tps: 9455.65 qps: 150217.52 (r/w/o: 94041.55/37303.67/18872.30) lat (ms,95%): 86.00 err/s: 1.00 reconn/s: 0.00
[ 103s ] thds: 512 tps: 9467.04 qps: 152027.77 (r/w/o: 95025.49/38025.20/18977.09) lat (ms,95%): 87.56 err/s: 2.00 reconn/s: 0.00
[ 104s ] thds: 512 tps: 9357.38 qps: 150866.13 (r/w/o: 94279.83/37870.54/18715.76) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 512 tps: 9443.78 qps: 152088.39 (r/w/o: 94718.79/38497.04/18872.57) lat (ms,95%): 92.42 err/s: 0.00 reconn/s: 0.00
[ 106s ] thds: 512 tps: 9373.91 qps: 148615.65 (r/w/o: 93035.16/36824.67/18755.83) lat (ms,95%): 94.10 err/s: 2.00 reconn/s: 0.00
[ 107s ] thds: 512 tps: 9289.61 qps: 149805.15 (r/w/o: 93646.35/37566.58/18592.22) lat (ms,95%): 90.78 err/s: 4.00 reconn/s: 0.00
[ 108s ] thds: 512 tps: 9408.87 qps: 146605.02 (r/w/o: 91367.77/36437.51/18799.75) lat (ms,95%): 99.33 err/s: 1.00 reconn/s: 0.00
[ 109s ] thds: 512 tps: 9178.11 qps: 148447.72 (r/w/o: 93182.08/36889.43/18376.21) lat (ms,95%): 90.78 err/s: 1.00 reconn/s: 0.00
[ 110s ] thds: 512 tps: 9321.13 qps: 150490.10 (r/w/o: 93997.31/37863.53/18629.26) lat (ms,95%): 94.10 err/s: 1.00 reconn/s: 0.00
[ 111s ] thds: 512 tps: 9277.72 qps: 149234.50 (r/w/o: 93276.19/37393.87/18564.44) lat (ms,95%): 92.42 err/s: 0.00 reconn/s: 0.00
[ 112s ] thds: 512 tps: 9665.13 qps: 153211.44 (r/w/o: 95673.55/38231.63/19306.26) lat (ms,95%): 92.42 err/s: 1.00 reconn/s: 0.00
[ 113s ] thds: 512 tps: 9301.10 qps: 151037.11 (r/w/o: 94399.32/38007.58/18630.21) lat (ms,95%): 99.33 err/s: 3.00 reconn/s: 0.00
[ 114s ] thds: 512 tps: 9499.62 qps: 151833.89 (r/w/o: 95158.17/37670.48/19005.23) lat (ms,95%): 86.00 err/s: 1.00 reconn/s: 0.00
[ 115s ] thds: 512 tps: 9622.43 qps: 152449.22 (r/w/o: 95266.52/37939.85/19242.85) lat (ms,95%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 116s ] thds: 512 tps: 9355.64 qps: 151060.53 (r/w/o: 94399.58/37946.67/18714.29) lat (ms,95%): 89.16 err/s: 1.00 reconn/s: 0.00
[ 117s ] thds: 512 tps: 9304.25 qps: 149293.02 (r/w/o: 93162.49/37519.03/18611.50) lat (ms,95%): 94.10 err/s: 4.00 reconn/s: 0.00
[ 118s ] thds: 512 tps: 9821.43 qps: 155387.46 (r/w/o: 96972.71/38785.89/19628.86) lat (ms,95%): 92.42 err/s: 1.00 reconn/s: 0.00
[ 119s ] thds: 512 tps: 9624.21 qps: 155632.26 (r/w/o: 97501.79/38865.04/19265.43) lat (ms,95%): 92.42 err/s: 1.00 reconn/s: 0.00
[ 120s ] thds: 512 tps: 9696.96 qps: 155013.34 (r/w/o: 96903.59/38719.84/19389.92) lat (ms,95%): 87.56 err/s: 2.00 reconn/s: 0.00
[ 121s ] thds: 512 tps: 9931.83 qps: 156845.29 (r/w/o: 97792.31/39236.32/19816.66) lat (ms,95%): 86.00 err/s: 2.00 reconn/s: 0.00
[ 122s ] thds: 512 tps: 9130.22 qps: 148578.50 (r/w/o: 92917.19/37347.88/18313.43) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 123s ] thds: 512 tps: 9777.00 qps: 155655.07 (r/w/o: 97269.05/38845.02/19541.01) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 124s ] thds: 512 tps: 9727.79 qps: 155098.70 (r/w/o: 97088.93/38537.18/19472.59) lat (ms,95%): 89.16 err/s: 4.00 reconn/s: 0.00
[ 125s ] thds: 512 tps: 9756.94 qps: 155638.03 (r/w/o: 97171.39/38949.76/19516.88) lat (ms,95%): 92.42 err/s: 1.00 reconn/s: 0.00
[ 126s ] thds: 512 tps: 9600.38 qps: 155412.14 (r/w/o: 97190.84/39019.54/19201.76) lat (ms,95%): 90.78 err/s: 1.00 reconn/s: 0.00
[ 127s ] thds: 512 tps: 9725.86 qps: 154529.76 (r/w/o: 96522.60/38566.44/19440.72) lat (ms,95%): 86.00 err/s: 1.00 reconn/s: 0.00
[ 128s ] thds: 512 tps: 9604.73 qps: 153237.62 (r/w/o: 95828.26/38189.91/19219.45) lat (ms,95%): 87.56 err/s: 4.00 reconn/s: 0.00
[ 129s ] thds: 512 tps: 9887.76 qps: 158382.05 (r/w/o: 99171.47/39427.07/19783.51) lat (ms,95%): 84.47 err/s: 4.00 reconn/s: 0.00
[ 130s ] thds: 512 tps: 9634.24 qps: 155202.20 (r/w/o: 96894.59/39047.13/19260.48) lat (ms,95%): 87.56 err/s: 2.00 reconn/s: 0.00
[ 131s ] thds: 512 tps: 9514.20 qps: 151253.20 (r/w/o: 94617.00/37603.80/19032.40) lat (ms,95%): 89.16 err/s: 3.00 reconn/s: 0.00
[ 132s ] thds: 512 tps: 9732.96 qps: 155554.30 (r/w/o: 97298.56/38777.82/19477.91) lat (ms,95%): 86.00 err/s: 2.00 reconn/s: 0.00
[ 133s ] thds: 512 tps: 9640.93 qps: 155378.90 (r/w/o: 96927.32/39173.72/19277.86) lat (ms,95%): 86.00 err/s: 3.00 reconn/s: 0.00
[ 134s ] thds: 512 tps: 9464.29 qps: 151514.62 (r/w/o: 94735.89/37840.15/18938.58) lat (ms,95%): 90.78 err/s: 2.00 reconn/s: 0.00
[ 135s ] thds: 512 tps: 9607.47 qps: 154602.78 (r/w/o: 96424.41/38962.42/19215.94) lat (ms,95%): 92.42 err/s: 1.00 reconn/s: 0.00
[ 136s ] thds: 512 tps: 9639.12 qps: 153587.44 (r/w/o: 96237.10/38078.09/19272.24) lat (ms,95%): 89.16 err/s: 2.00 reconn/s: 0.00
[ 137s ] thds: 512 tps: 9597.25 qps: 152010.94 (r/w/o: 94886.46/37957.98/19166.50) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 138s ] thds: 512 tps: 9932.15 qps: 156718.70 (r/w/o: 97637.50/39264.88/19816.33) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 139s ] thds: 512 tps: 9253.63 qps: 151710.79 (r/w/o: 95221.81/37898.69/18590.28) lat (ms,95%): 97.55 err/s: 1.00 reconn/s: 0.00
[ 140s ] thds: 512 tps: 9630.69 qps: 154086.11 (r/w/o: 96493.98/38324.74/19267.39) lat (ms,95%): 86.00 err/s: 4.00 reconn/s: 0.00
[ 141s ] thds: 512 tps: 9950.31 qps: 158609.78 (r/w/o: 99283.02/39426.14/19900.61) lat (ms,95%): 87.56 err/s: 2.00 reconn/s: 0.00
[ 142s ] thds: 512 tps: 9719.97 qps: 156489.57 (r/w/o: 97329.73/39722.89/19436.95) lat (ms,95%): 86.00 err/s: 1.00 reconn/s: 0.00
[ 143s ] thds: 512 tps: 9538.07 qps: 152359.04 (r/w/o: 95302.65/37976.26/19080.13) lat (ms,95%): 92.42 err/s: 1.00 reconn/s: 0.00
[ 144s ] thds: 512 tps: 9626.99 qps: 154596.82 (r/w/o: 96558.89/38777.96/19259.98) lat (ms,95%): 89.16 err/s: 4.00 reconn/s: 0.00
[ 145s ] thds: 512 tps: 9713.05 qps: 155076.80 (r/w/o: 97028.50/38620.20/19428.10) lat (ms,95%): 89.16 err/s: 2.00 reconn/s: 0.00
[ 146s ] thds: 512 tps: 10008.69 qps: 159202.05 (r/w/o: 99345.91/39839.76/20016.38) lat (ms,95%): 82.96 err/s: 1.00 reconn/s: 0.00
[ 147s ] thds: 512 tps: 9533.32 qps: 153778.08 (r/w/o: 96270.18/38437.27/19070.63) lat (ms,95%): 87.56 err/s: 1.00 reconn/s: 0.00
[ 148s ] thds: 512 tps: 9873.90 qps: 156707.34 (r/w/o: 98168.96/38789.59/19748.79) lat (ms,95%): 87.56 err/s: 1.00 reconn/s: 0.00
[ 149s ] thds: 512 tps: 9669.94 qps: 154290.21 (r/w/o: 96229.59/38734.74/19325.89) lat (ms,95%): 87.56 err/s: 3.00 reconn/s: 0.00
[ 150s ] thds: 512 tps: 9935.70 qps: 158255.24 (r/w/o: 98959.02/39418.81/19877.40) lat (ms,95%): 90.78 err/s: 3.00 reconn/s: 0.00
[ 151s ] thds: 512 tps: 9601.02 qps: 154070.17 (r/w/o: 96029.16/38898.96/19142.05) lat (ms,95%): 94.10 err/s: 1.00 reconn/s: 0.00
[ 152s ] thds: 512 tps: 9671.39 qps: 151930.16 (r/w/o: 95108.86/37405.52/19415.79) lat (ms,95%): 92.42 err/s: 2.00 reconn/s: 0.00
[ 153s ] thds: 512 tps: 9582.18 qps: 156813.93 (r/w/o: 98036.83/39625.74/19151.36) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 154s ] thds: 512 tps: 9498.17 qps: 152056.73 (r/w/o: 95358.85/37686.54/19011.34) lat (ms,95%): 92.42 err/s: 2.00 reconn/s: 0.00
[ 155s ] thds: 512 tps: 9753.06 qps: 155595.13 (r/w/o: 97273.70/38810.30/19511.13) lat (ms,95%): 95.81 err/s: 2.00 reconn/s: 0.00
[ 156s ] thds: 512 tps: 9864.83 qps: 159586.46 (r/w/o: 99445.39/40408.41/19732.66) lat (ms,95%): 84.47 err/s: 2.00 reconn/s: 0.00
[ 157s ] thds: 512 tps: 9191.71 qps: 147473.18 (r/w/o: 92007.07/37081.70/18384.42) lat (ms,95%): 94.10 err/s: 2.00 reconn/s: 0.00
[ 158s ] thds: 512 tps: 10123.49 qps: 159981.33 (r/w/o: 100444.29/39289.06/20247.98) lat (ms,95%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 159s ] thds: 512 tps: 9594.03 qps: 153523.41 (r/w/o: 95893.26/38441.10/19189.05) lat (ms,95%): 84.47 err/s: 1.00 reconn/s: 0.00
[ 160s ] thds: 512 tps: 9433.00 qps: 151465.01 (r/w/o: 94537.01/38061.00/18867.00) lat (ms,95%): 92.42 err/s: 2.00 reconn/s: 0.00
[ 161s ] thds: 512 tps: 9645.05 qps: 155510.84 (r/w/o: 96991.53/39228.21/19291.10) lat (ms,95%): 86.00 err/s: 1.00 reconn/s: 0.00
[ 162s ] thds: 512 tps: 10038.12 qps: 160158.12 (r/w/o: 100295.25/39783.63/20079.24) lat (ms,95%): 84.47 err/s: 3.00 reconn/s: 0.00
[ 163s ] thds: 512 tps: 9700.16 qps: 155630.58 (r/w/o: 97143.60/39086.67/19400.32) lat (ms,95%): 87.56 err/s: 1.00 reconn/s: 0.00
[ 164s ] thds: 512 tps: 9443.67 qps: 149961.18 (r/w/o: 93669.01/37404.83/18887.35) lat (ms,95%): 94.10 err/s: 2.00 reconn/s: 0.00
[ 165s ] thds: 512 tps: 9868.14 qps: 157279.18 (r/w/o: 98397.39/39151.51/19730.29) lat (ms,95%): 86.00 err/s: 4.00 reconn/s: 0.00
[ 166s ] thds: 512 tps: 9518.52 qps: 153827.12 (r/w/o: 96152.08/38630.00/19045.04) lat (ms,95%): 90.78 err/s: 1.00 reconn/s: 0.00
[ 167s ] thds: 512 tps: 9708.41 qps: 155820.84 (r/w/o: 97357.26/39036.76/19426.83) lat (ms,95%): 86.00 err/s: 3.00 reconn/s: 0.00
[ 168s ] thds: 512 tps: 9646.96 qps: 153578.37 (r/w/o: 96375.60/37905.84/19296.92) lat (ms,95%): 86.00 err/s: 3.00 reconn/s: 0.00
[ 169s ] thds: 512 tps: 9708.98 qps: 156143.67 (r/w/o: 97161.79/39562.92/19418.96) lat (ms,95%): 92.42 err/s: 3.00 reconn/s: 0.00
[ 170s ] thds: 512 tps: 9753.93 qps: 154168.88 (r/w/o: 96798.30/37863.72/19506.86) lat (ms,95%): 89.16 err/s: 0.00 reconn/s: 0.00
[ 171s ] thds: 512 tps: 9826.16 qps: 157426.60 (r/w/o: 98058.62/39710.66/19657.32) lat (ms,95%): 87.56 err/s: 5.00 reconn/s: 0.00
[ 172s ] thds: 512 tps: 9923.01 qps: 158939.07 (r/w/o: 99331.05/39757.00/19851.02) lat (ms,95%): 82.96 err/s: 4.00 reconn/s: 0.00
[ 173s ] thds: 512 tps: 9716.30 qps: 154234.44 (r/w/o: 96576.83/38223.00/19434.61) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 174s ] thds: 512 tps: 9394.61 qps: 151500.72 (r/w/o: 94334.09/38377.41/18789.22) lat (ms,95%): 87.56 err/s: 1.00 reconn/s: 0.00
[ 175s ] thds: 512 tps: 9721.14 qps: 156132.35 (r/w/o: 98054.52/38635.54/19442.28) lat (ms,95%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 176s ] thds: 512 tps: 9671.88 qps: 154644.13 (r/w/o: 96653.83/38644.53/19345.77) lat (ms,95%): 92.42 err/s: 1.00 reconn/s: 0.00
[ 177s ] thds: 512 tps: 9735.95 qps: 155340.17 (r/w/o: 97428.52/38439.75/19471.90) lat (ms,95%): 87.56 err/s: 1.00 reconn/s: 0.00
[ 178s ] thds: 512 tps: 9654.72 qps: 155642.28 (r/w/o: 96486.23/39852.60/19303.45) lat (ms,95%): 87.56 err/s: 4.00 reconn/s: 0.00
[ 179s ] thds: 512 tps: 9613.47 qps: 154595.86 (r/w/o: 96666.93/38689.98/19238.95) lat (ms,95%): 86.00 err/s: 1.00 reconn/s: 0.00
[ 180s ] thds: 512 tps: 9874.13 qps: 157675.18 (r/w/o: 98632.36/39294.56/19748.27) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 181s ] thds: 512 tps: 9971.22 qps: 158212.73 (r/w/o: 99020.30/39285.98/19906.44) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 182s ] thds: 512 tps: 9570.24 qps: 153062.86 (r/w/o: 95819.39/38066.00/19177.47) lat (ms,95%): 90.78 err/s: 1.00 reconn/s: 0.00
[ 183s ] thds: 512 tps: 9710.54 qps: 156880.08 (r/w/o: 97719.59/39739.41/19421.09) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 184s ] thds: 512 tps: 9876.18 qps: 157445.05 (r/w/o: 98488.89/39207.79/19748.37) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 185s ] thds: 512 tps: 9891.11 qps: 158515.77 (r/w/o: 98997.09/39741.47/19777.21) lat (ms,95%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 186s ] thds: 512 tps: 9942.70 qps: 159053.21 (r/w/o: 99598.00/39558.81/19896.40) lat (ms,95%): 86.00 err/s: 2.00 reconn/s: 0.00
[ 187s ] thds: 512 tps: 9533.48 qps: 152991.75 (r/w/o: 95432.82/38490.98/19067.96) lat (ms,95%): 87.56 err/s: 1.00 reconn/s: 0.00
[ 188s ] thds: 512 tps: 9982.17 qps: 158407.20 (r/w/o: 99395.85/39044.01/19967.34) lat (ms,95%): 90.78 err/s: 4.00 reconn/s: 0.00
[ 189s ] thds: 512 tps: 9525.93 qps: 153423.95 (r/w/o: 95602.32/38771.78/19049.86) lat (ms,95%): 92.42 err/s: 4.00 reconn/s: 0.00
[ 190s ] thds: 512 tps: 9606.05 qps: 154286.87 (r/w/o: 96291.51/38773.26/19222.09) lat (ms,95%): 92.42 err/s: 3.00 reconn/s: 0.00
[ 191s ] thds: 512 tps: 10172.91 qps: 157942.06 (r/w/o: 98494.11/39154.12/20293.84) lat (ms,95%): 86.00 err/s: 1.00 reconn/s: 0.00
[ 192s ] thds: 512 tps: 9231.00 qps: 151634.80 (r/w/o: 95336.62/37785.17/18513.00) lat (ms,95%): 89.16 err/s: 0.00 reconn/s: 0.00
[ 193s ] thds: 512 tps: 10004.34 qps: 157813.83 (r/w/o: 98432.68/39366.47/20014.68) lat (ms,95%): 89.16 err/s: 4.00 reconn/s: 0.00
[ 194s ] thds: 512 tps: 9517.82 qps: 153144.04 (r/w/o: 95877.13/38229.27/19037.64) lat (ms,95%): 86.00 err/s: 4.00 reconn/s: 0.00
[ 195s ] thds: 512 tps: 9453.99 qps: 152219.19 (r/w/o: 95265.16/38044.04/18909.99) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 196s ] thds: 512 tps: 9414.46 qps: 151177.40 (r/w/o: 94362.63/37984.84/18829.93) lat (ms,95%): 87.56 err/s: 1.00 reconn/s: 0.00
[ 197s ] thds: 512 tps: 9716.49 qps: 153869.75 (r/w/o: 95745.82/38717.95/19405.98) lat (ms,95%): 90.78 err/s: 2.00 reconn/s: 0.00
[ 198s ] thds: 512 tps: 9884.57 qps: 160593.53 (r/w/o: 100554.99/40238.40/19800.15) lat (ms,95%): 82.96 err/s: 2.00 reconn/s: 0.00
[ 199s ] thds: 512 tps: 9728.71 qps: 154000.81 (r/w/o: 96688.28/37856.10/19456.43) lat (ms,95%): 82.96 err/s: 3.00 reconn/s: 0.00
[ 200s ] thds: 512 tps: 9825.89 qps: 159049.77 (r/w/o: 98957.10/40432.89/19659.78) lat (ms,95%): 90.78 err/s: 4.00 reconn/s: 0.00
[ 201s ] thds: 512 tps: 9899.72 qps: 157410.82 (r/w/o: 98673.32/38934.05/19803.45) lat (ms,95%): 89.16 err/s: 4.00 reconn/s: 0.00
[ 202s ] thds: 512 tps: 9509.08 qps: 153271.98 (r/w/o: 95484.67/38766.15/19021.15) lat (ms,95%): 89.16 err/s: 3.00 reconn/s: 0.00
[ 203s ] thds: 512 tps: 10082.78 qps: 158710.55 (r/w/o: 99814.83/38732.16/20163.56) lat (ms,95%): 80.03 err/s: 2.00 reconn/s: 0.00
[ 204s ] thds: 512 tps: 9435.21 qps: 153153.80 (r/w/o: 95327.28/38951.10/18875.41) lat (ms,95%): 92.42 err/s: 1.00 reconn/s: 0.00
[ 205s ] thds: 512 tps: 10009.58 qps: 159107.35 (r/w/o: 99407.85/39687.35/20012.15) lat (ms,95%): 87.56 err/s: 4.00 reconn/s: 0.00
[ 206s ] thds: 512 tps: 9782.82 qps: 155900.85 (r/w/o: 97713.14/38613.07/19574.64) lat (ms,95%): 90.78 err/s: 2.00 reconn/s: 0.00
[ 207s ] thds: 512 tps: 10026.95 qps: 160116.16 (r/w/o: 99987.47/40069.79/20058.89) lat (ms,95%): 81.48 err/s: 1.00 reconn/s: 0.00
[ 208s ] thds: 512 tps: 9871.77 qps: 156921.39 (r/w/o: 97591.75/39634.09/19695.55) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 209s ] thds: 512 tps: 9498.13 qps: 153391.09 (r/w/o: 96143.31/38204.52/19043.26) lat (ms,95%): 89.16 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 512 tps: 9614.85 qps: 154590.08 (r/w/o: 96562.21/38805.17/19222.70) lat (ms,95%): 86.00 err/s: 4.00 reconn/s: 0.00
[ 211s ] thds: 512 tps: 9826.63 qps: 157696.15 (r/w/o: 98849.39/39180.50/19666.26) lat (ms,95%): 82.96 err/s: 1.00 reconn/s: 0.00
[ 212s ] thds: 512 tps: 9719.93 qps: 155141.76 (r/w/o: 96898.21/38801.69/19441.86) lat (ms,95%): 87.56 err/s: 2.00 reconn/s: 0.00
[ 213s ] thds: 512 tps: 9653.12 qps: 154869.98 (r/w/o: 96875.24/38685.49/19309.25) lat (ms,95%): 82.96 err/s: 3.00 reconn/s: 0.00
[ 214s ] thds: 512 tps: 10188.14 qps: 160088.70 (r/w/o: 99711.75/39998.68/20378.27) lat (ms,95%): 86.00 err/s: 3.00 reconn/s: 0.00
[ 215s ] thds: 512 tps: 9717.22 qps: 158217.79 (r/w/o: 99162.40/39621.95/19433.43) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 216s ] thds: 512 tps: 9886.18 qps: 157523.62 (r/w/o: 98228.57/39528.70/19766.35) lat (ms,95%): 87.56 err/s: 2.00 reconn/s: 0.00
[ 217s ] thds: 512 tps: 9900.31 qps: 159620.02 (r/w/o: 99859.14/39951.26/19809.62) lat (ms,95%): 87.56 err/s: 3.00 reconn/s: 0.00
[ 218s ] thds: 512 tps: 9938.80 qps: 158777.82 (r/w/o: 99371.01/39521.21/19885.60) lat (ms,95%): 89.16 err/s: 4.00 reconn/s: 0.00
[ 219s ] thds: 512 tps: 9907.91 qps: 155207.60 (r/w/o: 96904.13/38494.65/19808.82) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 512 tps: 9441.04 qps: 154208.60 (r/w/o: 96707.38/38610.15/18891.07) lat (ms,95%): 89.16 err/s: 2.00 reconn/s: 0.00
[ 221s ] thds: 512 tps: 9877.00 qps: 156070.03 (r/w/o: 97566.02/38747.01/19757.00) lat (ms,95%): 86.00 err/s: 3.00 reconn/s: 0.00
[ 222s ] thds: 512 tps: 9654.91 qps: 156726.48 (r/w/o: 97620.05/39799.61/19306.81) lat (ms,95%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 223s ] thds: 512 tps: 9916.19 qps: 158910.01 (r/w/o: 99426.89/39644.75/19838.38) lat (ms,95%): 86.00 err/s: 3.00 reconn/s: 0.00
[ 224s ] thds: 512 tps: 9638.33 qps: 154966.93 (r/w/o: 96560.20/39129.09/19277.65) lat (ms,95%): 97.55 err/s: 1.00 reconn/s: 0.00
[ 225s ] thds: 512 tps: 9680.78 qps: 154604.35 (r/w/o: 96805.79/38435.00/19363.56) lat (ms,95%): 89.16 err/s: 2.00 reconn/s: 0.00
[ 226s ] thds: 512 tps: 9494.80 qps: 149807.84 (r/w/o: 93640.02/37199.21/18968.60) lat (ms,95%): 90.78 err/s: 3.00 reconn/s: 0.00
[ 227s ] thds: 512 tps: 9844.10 qps: 159415.62 (r/w/o: 99724.01/39979.41/19712.20) lat (ms,95%): 89.16 err/s: 0.00 reconn/s: 0.00
[ 228s ] thds: 512 tps: 9601.78 qps: 152386.14 (r/w/o: 94959.36/38228.21/19198.56) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 229s ] thds: 512 tps: 9625.89 qps: 155830.33 (r/w/o: 97414.96/39156.60/19258.77) lat (ms,95%): 81.48 err/s: 2.00 reconn/s: 0.00
[ 230s ] thds: 512 tps: 9832.30 qps: 156651.53 (r/w/o: 98052.90/38935.03/19663.60) lat (ms,95%): 87.56 err/s: 3.00 reconn/s: 0.00
[ 231s ] thds: 512 tps: 9492.12 qps: 151302.93 (r/w/o: 94561.20/37754.48/18987.24) lat (ms,95%): 86.00 err/s: 1.00 reconn/s: 0.00
[ 232s ] thds: 512 tps: 10027.91 qps: 160325.61 (r/w/o: 100387.13/39880.65/20057.83) lat (ms,95%): 89.16 err/s: 1.00 reconn/s: 0.00
[ 233s ] thds: 512 tps: 9593.08 qps: 154189.26 (r/w/o: 96198.78/38803.32/19187.16) lat (ms,95%): 82.96 err/s: 1.00 reconn/s: 0.00
[ 234s ] thds: 512 tps: 9830.02 qps: 155812.25 (r/w/o: 97594.15/38561.06/19657.03) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 235s ] thds: 512 tps: 9959.86 qps: 159805.79 (r/w/o: 99941.62/39939.45/19924.72) lat (ms,95%): 80.03 err/s: 2.00 reconn/s: 0.00
[ 236s ] thds: 512 tps: 9522.00 qps: 152768.96 (r/w/o: 95158.98/38566.99/19043.00) lat (ms,95%): 81.48 err/s: 1.00 reconn/s: 0.00
[ 237s ] thds: 512 tps: 9622.32 qps: 155194.24 (r/w/o: 96946.27/38997.32/19250.65) lat (ms,95%): 86.00 err/s: 3.00 reconn/s: 0.00
[ 238s ] thds: 512 tps: 9843.59 qps: 155909.54 (r/w/o: 97840.94/38380.41/19688.18) lat (ms,95%): 84.47 err/s: 1.00 reconn/s: 0.00
[ 239s ] thds: 512 tps: 10047.10 qps: 161448.56 (r/w/o: 100804.97/40548.39/20095.19) lat (ms,95%): 86.00 err/s: 1.00 reconn/s: 0.00
[ 240s ] thds: 512 tps: 9692.10 qps: 152204.60 (r/w/o: 94780.00/38059.40/19365.20) lat (ms,95%): 89.16 err/s: 0.00 reconn/s: 0.00
[ 241s ] thds: 512 tps: 9614.88 qps: 154332.09 (r/w/o: 96562.81/38524.52/19244.76) lat (ms,95%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 242s ] thds: 512 tps: 9431.12 qps: 153762.35 (r/w/o: 95983.87/38935.24/18843.24) lat (ms,95%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 243s ] thds: 512 tps: 9592.02 qps: 153161.33 (r/w/o: 95908.24/38052.03/19201.05) lat (ms,95%): 92.42 err/s: 2.00 reconn/s: 0.00
[ 244s ] thds: 512 tps: 9799.05 qps: 157086.76 (r/w/o: 98334.48/39143.19/19609.10) lat (ms,95%): 94.10 err/s: 4.00 reconn/s: 0.00
[ 245s ] thds: 512 tps: 9621.95 qps: 154257.13 (r/w/o: 96367.45/38641.78/19247.89) lat (ms,95%): 84.47 err/s: 3.00 reconn/s: 0.00
[ 246s ] thds: 512 tps: 10082.83 qps: 159550.23 (r/w/o: 99637.27/39786.31/20126.65) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 247s ] thds: 512 tps: 9583.09 qps: 154739.47 (r/w/o: 96653.92/38882.37/19203.18) lat (ms,95%): 87.56 err/s: 1.00 reconn/s: 0.00
[ 248s ] thds: 512 tps: 9781.87 qps: 156397.96 (r/w/o: 97703.73/39144.49/19549.75) lat (ms,95%): 89.16 err/s: 2.00 reconn/s: 0.00
[ 249s ] thds: 512 tps: 9854.14 qps: 156425.27 (r/w/o: 98148.42/38548.56/19728.29) lat (ms,95%): 89.16 err/s: 3.00 reconn/s: 0.00
[ 250s ] thds: 512 tps: 9602.97 qps: 151832.49 (r/w/o: 94633.68/38028.87/19169.94) lat (ms,95%): 94.10 err/s: 1.00 reconn/s: 0.00
[ 251s ] thds: 512 tps: 9476.13 qps: 154364.11 (r/w/o: 96743.32/38629.53/18991.26) lat (ms,95%): 84.47 err/s: 5.00 reconn/s: 0.00
[ 252s ] thds: 512 tps: 9902.76 qps: 158229.20 (r/w/o: 98690.63/39754.05/19784.52) lat (ms,95%): 87.56 err/s: 1.00 reconn/s: 0.00
[ 253s ] thds: 512 tps: 9840.93 qps: 157881.89 (r/w/o: 98641.30/39530.72/19709.86) lat (ms,95%): 86.00 err/s: 2.00 reconn/s: 0.00
[ 254s ] thds: 512 tps: 9681.26 qps: 151265.02 (r/w/o: 94293.51/37695.00/19276.51) lat (ms,95%): 81.48 err/s: 2.00 reconn/s: 0.00
[ 255s ] thds: 512 tps: 9385.89 qps: 152852.29 (r/w/o: 96238.07/37778.47/18835.75) lat (ms,95%): 87.56 err/s: 2.00 reconn/s: 0.00
[ 256s ] thds: 512 tps: 9573.32 qps: 153150.13 (r/w/o: 95592.21/38390.27/19167.64) lat (ms,95%): 89.16 err/s: 2.00 reconn/s: 0.00
[ 257s ] thds: 512 tps: 9267.16 qps: 148757.46 (r/w/o: 92535.58/37702.57/18519.31) lat (ms,95%): 87.56 err/s: 4.00 reconn/s: 0.00
[ 258s ] thds: 512 tps: 9674.71 qps: 156636.98 (r/w/o: 97867.87/39388.69/19380.42) lat (ms,95%): 89.16 err/s: 4.00 reconn/s: 0.00
[ 259s ] thds: 512 tps: 9876.79 qps: 156654.36 (r/w/o: 98195.78/38705.01/19753.58) lat (ms,95%): 84.47 err/s: 1.00 reconn/s: 0.00
[ 260s ] thds: 512 tps: 9724.30 qps: 155256.75 (r/w/o: 97153.98/38653.17/19449.60) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 261s ] thds: 512 tps: 9526.44 qps: 153680.31 (r/w/o: 95723.52/38903.90/19052.89) lat (ms,95%): 89.16 err/s: 1.00 reconn/s: 0.00
[ 262s ] thds: 512 tps: 9943.62 qps: 157031.02 (r/w/o: 98482.25/38661.53/19887.24) lat (ms,95%): 87.56 err/s: 3.00 reconn/s: 0.00
[ 263s ] thds: 512 tps: 9604.89 qps: 155084.66 (r/w/o: 96926.16/38946.72/19211.78) lat (ms,95%): 89.16 err/s: 1.00 reconn/s: 0.00
[ 264s ] thds: 512 tps: 9696.83 qps: 153758.31 (r/w/o: 95998.32/38362.33/19397.66) lat (ms,95%): 90.78 err/s: 2.00 reconn/s: 0.00
[ 265s ] thds: 512 tps: 9667.39 qps: 157047.31 (r/w/o: 97901.94/39809.60/19335.78) lat (ms,95%): 90.78 err/s: 1.00 reconn/s: 0.00
[ 266s ] thds: 512 tps: 9950.92 qps: 158753.76 (r/w/o: 99534.23/39313.69/19905.85) lat (ms,95%): 82.96 err/s: 3.00 reconn/s: 0.00
[ 267s ] thds: 512 tps: 9729.87 qps: 154095.95 (r/w/o: 96362.72/38273.49/19459.74) lat (ms,95%): 89.16 err/s: 0.00 reconn/s: 0.00
[ 268s ] thds: 512 tps: 9521.07 qps: 153934.16 (r/w/o: 96025.72/38865.29/19043.14) lat (ms,95%): 92.42 err/s: 1.00 reconn/s: 0.00
[ 269s ] thds: 512 tps: 9859.84 qps: 155349.46 (r/w/o: 97131.41/38496.37/19721.68) lat (ms,95%): 86.00 err/s: 2.00 reconn/s: 0.00
[ 270s ] thds: 512 tps: 9730.02 qps: 157181.37 (r/w/o: 98464.23/39257.09/19460.05) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 271s ] thds: 512 tps: 9334.19 qps: 150508.00 (r/w/o: 93686.87/38149.76/18671.37) lat (ms,95%): 92.42 err/s: 3.00 reconn/s: 0.00
[ 272s ] thds: 512 tps: 9783.65 qps: 155011.48 (r/w/o: 96926.55/38517.63/19567.30) lat (ms,95%): 77.19 err/s: 1.00 reconn/s: 0.00
[ 273s ] thds: 512 tps: 9791.26 qps: 157040.24 (r/w/o: 98592.66/38863.05/19584.53) lat (ms,95%): 82.96 err/s: 3.00 reconn/s: 0.00
[ 274s ] thds: 512 tps: 9884.85 qps: 156608.64 (r/w/o: 97267.53/39576.40/19764.70) lat (ms,95%): 89.16 err/s: 2.00 reconn/s: 0.00
[ 275s ] thds: 512 tps: 9614.80 qps: 156569.75 (r/w/o: 97872.97/39466.18/19230.60) lat (ms,95%): 87.56 err/s: 2.00 reconn/s: 0.00
[ 276s ] thds: 512 tps: 9902.12 qps: 157600.83 (r/w/o: 98784.15/38999.45/19817.23) lat (ms,95%): 86.00 err/s: 4.00 reconn/s: 0.00
[ 277s ] thds: 512 tps: 9639.26 qps: 155601.21 (r/w/o: 97089.63/39231.06/19280.52) lat (ms,95%): 87.56 err/s: 1.00 reconn/s: 0.00
[ 278s ] thds: 512 tps: 9661.74 qps: 153562.90 (r/w/o: 96089.44/38153.98/19319.48) lat (ms,95%): 87.56 err/s: 2.00 reconn/s: 0.00
[ 279s ] thds: 512 tps: 9877.18 qps: 158342.87 (r/w/o: 99102.79/39478.71/19761.36) lat (ms,95%): 84.47 err/s: 1.00 reconn/s: 0.00
[ 280s ] thds: 512 tps: 9637.96 qps: 153608.34 (r/w/o: 96147.59/38184.84/19275.92) lat (ms,95%): 89.16 err/s: 0.00 reconn/s: 0.00
[ 281s ] thds: 512 tps: 9572.69 qps: 154613.28 (r/w/o: 96196.67/39271.23/19145.39) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 282s ] thds: 512 tps: 9860.56 qps: 157195.64 (r/w/o: 98452.52/39023.00/19720.12) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 283s ] thds: 512 tps: 9853.95 qps: 156418.16 (r/w/o: 97826.47/38882.79/19708.89) lat (ms,95%): 87.56 err/s: 1.00 reconn/s: 0.00
[ 284s ] thds: 512 tps: 9554.43 qps: 154744.65 (r/w/o: 96429.73/39204.06/19110.87) lat (ms,95%): 89.16 err/s: 1.00 reconn/s: 0.00
[ 285s ] thds: 512 tps: 9974.39 qps: 159547.15 (r/w/o: 99763.87/39832.51/19950.77) lat (ms,95%): 89.16 err/s: 2.00 reconn/s: 0.00
[ 286s ] thds: 512 tps: 9806.53 qps: 155982.30 (r/w/o: 97555.20/38817.05/19610.05) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 287s ] thds: 512 tps: 9772.88 qps: 155464.13 (r/w/o: 97665.83/38249.54/19548.77) lat (ms,95%): 84.47 err/s: 1.00 reconn/s: 0.00
[ 288s ] thds: 512 tps: 9803.96 qps: 156936.32 (r/w/o: 97535.58/39817.83/19582.92) lat (ms,95%): 87.56 err/s: 2.00 reconn/s: 0.00
[ 289s ] thds: 512 tps: 9735.91 qps: 156615.50 (r/w/o: 98076.06/39050.63/19488.81) lat (ms,95%): 82.96 err/s: 4.00 reconn/s: 0.00
[ 290s ] thds: 512 tps: 9954.18 qps: 157911.84 (r/w/o: 99133.78/38853.70/19924.36) lat (ms,95%): 92.42 err/s: 4.00 reconn/s: 0.00
[ 291s ] thds: 512 tps: 9401.75 qps: 152748.24 (r/w/o: 94795.26/39149.48/18803.51) lat (ms,95%): 86.00 err/s: 2.00 reconn/s: 0.00
[ 292s ] thds: 512 tps: 9885.39 qps: 156385.55 (r/w/o: 98201.63/38411.15/19772.77) lat (ms,95%): 84.47 err/s: 2.00 reconn/s: 0.00
[ 293s ] thds: 512 tps: 9733.25 qps: 157713.08 (r/w/o: 98134.54/40106.04/19472.50) lat (ms,95%): 87.56 err/s: 1.00 reconn/s: 0.00
[ 294s ] thds: 512 tps: 10107.58 qps: 157696.38 (r/w/o: 98545.86/38948.37/20202.15) lat (ms,95%): 84.47 err/s: 1.00 reconn/s: 0.00
[ 295s ] thds: 512 tps: 9375.86 qps: 154099.27 (r/w/o: 96328.29/39002.26/18768.72) lat (ms,95%): 81.48 err/s: 3.00 reconn/s: 0.00
[ 296s ] thds: 512 tps: 9824.29 qps: 156437.50 (r/w/o: 97919.83/38873.09/19644.57) lat (ms,95%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 297s ] thds: 512 tps: 9788.84 qps: 155671.41 (r/w/o: 97178.38/38935.35/19557.67) lat (ms,95%): 87.56 err/s: 3.00 reconn/s: 0.00
[ 298s ] thds: 512 tps: 9927.23 qps: 158071.72 (r/w/o: 98999.33/39206.92/19865.47) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 299s ] thds: 512 tps: 9630.05 qps: 155912.82 (r/w/o: 97477.52/39157.21/19278.10) lat (ms,95%): 86.00 err/s: 2.00 reconn/s: 0.00
[ 300s ] thds: 512 tps: 9708.10 qps: 155190.61 (r/w/o: 96926.01/38848.40/19416.20) lat (ms,95%): 92.42 err/s: 1.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            28280230
        write:                           11310822
        other:                           5655557
        total:                           45246609
    transactions:                        2827534 (9421.39 per sec.)
    queries:                             45246609 (150762.44 per sec.)
    ignored errors:                      489    (1.63 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.1173s
    total number of events:              2827534

Latency (ms):
         min:                                   12.25
         avg:                                   54.32
         max:                                  898.17
         95th percentile:                       90.78
         sum:                            153604606.04

Threads fairness:
    events (avg/stddev):           5522.5273/32.63
    execution time (avg/stddev):   300.0090/0.01